G53 ; 기계좌표계 기준으로 동작
; 추후에 G00 코드 를 G01

G01 X9.6 F1000;
G04 X0.5

; 혈액  Kit 주입하기
M504 P5;
G04 X0.5;
M504 P7; 
G04 X0.5;

G01 Z45 F80;   check time 
G04 X0.5;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; 1과정 시액  주입 과정
M504 P5;
G04 X0.5;
M503 P7; 
G04 X0.5;

G01 Y47.0 F500;  ;;G00 Y0 변경함 
G04 X0.5;
G01 A25.6 F80; ;; A축 높이 Check 
G04 X0.2;

G01 Y62.13 F100;
G04 X0.4;

G01 A0.0 F80;
G04 X0.2;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
M503 P5;
G04 X0.5;
M504 P7; 
G04 X0.5;

G01 A26.6 F80;
G04 X0.2;

G01 Y47.0 F100;
G04 X0.4;

G01 A0.0 F200;
G04 X0.2;
G01 Z0.0 F200;
G04 X0.3;
G01 X0.0 F1000;
G04 X0.3;
G01 Y0.0 F1000;
G04 X0.3;

M30 ; 프로그램 종료
